OpenNuvoton/M2354BSP/SampleCode/SecureApplication/USBH_SecureISP/ProcessCommand.c
    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);
    if(usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while(g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if(_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if(g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    if(g_ReturnData.au32Data[0] != 0)
        return g_ReturnData.au32Data[0];

    /* Generate 1st ECDH key */
    ECC_ENABLE_INT(CRPT);
    if(ECC_GenerateSecretZ(CRPT, CURVE_P_256, (char *)g_acPriv, (char *)g_acClientPub0, (char *)g_acClientPub1, g_ChipISPInfo.KeyZ) < 0)
    {
        DBG("ECC ECDH share key calculation fail!!\n");
        return -1;
    }
    DBG("Generate 1st ECDH: %s\n\n", g_ChipISPInfo.KeyZ);

    CRPT_Hex2Reg((char *)g_ChipISPInfo.KeyZ, tmp);
    BytesSwap((char *)tmp, sizeof(tmp));
    for(i = 0; i < 8; i++)
        g_ChipISPInfo.au32AESKey[i] = Swap32(tmp[i]);

    return 0;
}

static int32_t ECDH_2_GetPub0(void)
{
    uint32_t    i, u32PacketID;

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_ECDH_GET_PUB0;
    g_WriteCmd.u16PacketID  = u32PacketID;
    g_WriteCmd.u16Len       = 0;

    if(_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);
    if(usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while(g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if(_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if(g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    if(g_ReturnData.au32Data[0] != 0)
        return g_ReturnData.au32Data[0];

    memcpy(g_ChipISPInfo.ClientPubKey.au32Key0, (char*)(&g_ReturnData.au32Data[1]), sizeof(g_ChipISPInfo.ClientPubKey.au32Key0));

    return 0;
}

static int32_t ECDH_3_GetPub1(void)
{
    uint32_t    i, u32PacketID = 0xE3;
    uint32_t    tmp[8];

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_ECDH_GET_PUB1;
    g_WriteCmd.u16PacketID  = u32PacketID;
    g_WriteCmd.u16Len       = 0;

    if(_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);
    if(usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while(g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if(_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if(g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    if(g_ReturnData.au32Data[0] != 0)
        return g_ReturnData.au32Data[0];


    memcpy(g_ChipISPInfo.ClientPubKey.au32Key1, (char*)(&g_ReturnData.au32Data[1]), sizeof(g_ChipISPInfo.ClientPubKey.au32Key1));

    memset(g_ChipISPInfo.Qx, 0x0, sizeof(g_ChipISPInfo.Qx));
    memset(g_ChipISPInfo.Qy, 0x0, sizeof(g_ChipISPInfo.Qy));

    /* Set Qx */
    memcpy(tmp, (char*)g_ChipISPInfo.ClientPubKey.au32Key0, sizeof(tmp));
    BytesSwap((char*)tmp, sizeof(tmp));
    CRPT_Reg2Hex(64, tmp, g_ChipISPInfo.Qx);

    /* Set Qy */
    memcpy(tmp, (char*)g_ChipISPInfo.ClientPubKey.au32Key1, sizeof(tmp));
    BytesSwap((char*)tmp, sizeof(tmp));
    CRPT_Reg2Hex(64, tmp, g_ChipISPInfo.Qy);

    DBG("Qx: %s\n", g_ChipISPInfo.Qx);
    DBG("Qy: %s\n", g_ChipISPInfo.Qy);

#if 0 /* Identify SecureISPDemo's public key ? */
    if(_strkeycmp(g_ChipISPInfo.Qx, (char *)g_acClientPub0) != 0)
    {
        DBG("Qx [%s] is not matched with expected [%s]!\n", g_ChipISPInfo.Qx, g_acClientPub0);
        return -1;
    }
    if(_strkeycmp(g_ChipISPInfo.Qy, (char *)g_acClientPub1) != 0)
    {
        DBG("Qy [%s] is not matched with expected [%s]!\n", g_ChipISPInfo.Qx, g_acClientPub1);
        return -1;
    }
    DBG("\n");
#endif

    return 0;
}

static uint8_t Byte2Char(uint8_t c)
{
    if(c < 10)
        return (c + '0');
    if(c < 16)
        return (c - 10 + 'a');

    return 0;
}
static void Generate_RandECCKey(void)
{
    int32_t i, j, m;
    int32_t i32NBits, i32Err;
    uint32_t    au32Buf[8];
    uint8_t     *pu8Buf;
    uint32_t    u32Ticks;

    memset(g_ChipISPInfo.d, 0x0, sizeof(g_ChipISPInfo.d));
    memset(g_ChipISPInfo.Qx, 0x0, sizeof(g_ChipISPInfo.Qx));
    memset(g_ChipISPInfo.Qy, 0x0, sizeof(g_ChipISPInfo.Qy));

    i32NBits = 256;

    ECC_ENABLE_INT(CRPT);

    do
    {
        /* Generate random number for private key */
        if(RNG_Random(au32Buf, 8) == 0)
            return ;

        pu8Buf = (uint8_t *)au32Buf;
        for(i = 0, j = 0; i < i32NBits / 8; i++)
        {
            g_ChipISPInfo.d[j++] = Byte2Char(pu8Buf[i] & 0xf);
            g_ChipISPInfo.d[j++] = Byte2Char(pu8Buf[i] >> 4);
        }
        g_ChipISPInfo.d[j] = 0; // NULL end

        DBG("Private key = %s\n", g_ChipISPInfo.d);

        /* Check if the private key valid */
        if(ECC_IsPrivateKeyValid(CRPT, CURVE_P_256, g_ChipISPInfo.d))
        {
            //DBG("Private key check ok\n");
            break;
        }
        else
        {
            /* Invalid key */
            DBG("Current private key is not valid. Need a new one.\n");
        }
    }
    while(1);

