OpenNuvoton/M2354BSP/SampleCode/SecureApplication/USBH_SecureISP/ProcessCommand.c
    DBG("Qx: %s\n", g_ChipISPInfo.Qx);
    DBG("Qy: %s\n", g_ChipISPInfo.Qy);

    ECC_ENABLE_INT(CRPT);
    if(ECC_GenerateSecretZ(CRPT, CURVE_P_256, (char *)g_ChipISPInfo.d, (char *)g_ChipISPInfo.Qx, (char *)g_ChipISPInfo.Qy, g_ChipISPInfo.KeyZ) < 0)
    {
        DBG("ECC ECDH share key calculation fail!!\n");
        return -1;
    }
    DBG("Generate 2nd ECDH: %s\n\n", g_ChipISPInfo.KeyZ);

    CRPT_Hex2Reg((char *)g_ChipISPInfo.KeyZ, tmp);
    BytesSwap((char *)tmp, sizeof(tmp));
    for(i = 0; i < 8; i++)
        g_ChipISPInfo.au32AESKey[i] = Swap32(tmp[i]);

    return 0;
}

static int32_t Process_ECDH(void)
{
    CRPT_Hex2Reg((char *)g_acPub0, g_ChipISPInfo.ServerPubKey.au32Key0);
    CRPT_Hex2Reg((char *)g_acPub1, g_ChipISPInfo.ServerPubKey.au32Key1);
    BytesSwap((char *)g_ChipISPInfo.ServerPubKey.au32Key0, sizeof(g_ChipISPInfo.ServerPubKey.au32Key0));
    BytesSwap((char *)g_ChipISPInfo.ServerPubKey.au32Key1, sizeof(g_ChipISPInfo.ServerPubKey.au32Key1));

    if(ECDH_0_SendPub0() != 0)
    {
        DBG("\n[FAIL] ==> ECDH_0_SendPub0.\n");
        return -1;
    }
    if(ECDH_1_SendPub1() != 0)
    {
        DBG("\n[FAIL] ==> ECDH_1_SendPub1.\n");
        return -1;
    }

    /* The following commands are encrypted by 1st ECDH key */
    if(ECDH_2_GetPub0() != 0)
    {
        DBG("\n[FAIL] ==> ECDH_2_GetPub0.\n");
        return -1;
    }
    if(ECDH_3_GetPub1() != 0)
    {
        DBG("\n[FAIL] ==> ECDH_3_GetPub1.\n");
        return -1;
    }

    if(ECDH_4_SendRandPub0() != 0)
    {
        DBG("\n[FAIL] ==> ECDH_4_SendRandPub0.\n");
        return -1;
    }
    if(ECDH_5_SendRandPub1() != 0)
    {
        DBG("\n[FAIL] ==> ECDH_5_SendRandPub1.\n");
        return -1;
    }
    if(ECDH_6_GetRandPub0() != 0)
    {
        DBG("\n[FAIL] ==> ECDH_6_GetRandPub0.\n");
        return -1;
    }
    if(ECDH_7_GetRandPub1() != 0)
    {
        DBG("\n[FAIL] ==> ECDH_7_GetRandPub1.\n");
        return -1;
    }

    return 0;
}

static int32_t Process_GetID(void)
{
    uint32_t    i, u32PacketID = 0x30;

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_GET_ID;
    g_WriteCmd.u16PacketID  = u32PacketID;
    g_WriteCmd.u16Len       = 0;

    if(_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);
    if(usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while(g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if(_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if(g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    if(g_ReturnData.au32Data[0] != 0)
        return g_ReturnData.au32Data[0];


    g_ChipISPInfo.u32PID        = g_ReturnData.au32Data[1];
    memcpy(g_ChipISPInfo.au32UID, &g_ReturnData.au32Data[2], sizeof(g_ChipISPInfo.au32UID));
    memcpy(g_ChipISPInfo.au32UCID, &g_ReturnData.au32Data[5], sizeof(g_ChipISPInfo.au32UCID));
    g_ChipISPInfo.u32CID        = g_ReturnData.au32Data[9];
    g_ChipISPInfo.u32DID        = g_ReturnData.au32Data[10];


    printf("* PID:  0x%08x\n", g_ChipISPInfo.u32PID);
    printf("* UID:  0x%08x, 0x%08x, 0x%08x\n",
           g_ChipISPInfo.au32UID[0], g_ChipISPInfo.au32UID[1], g_ChipISPInfo.au32UID[2]);
    printf("* UCID: 0x%08x, 0x%08x, 0x%08x, 0x%08x\n",
           g_ChipISPInfo.au32UCID[0], g_ChipISPInfo.au32UCID[1], g_ChipISPInfo.au32UCID[2], g_ChipISPInfo.au32UCID[3]);
    printf("\n");

    return 0;
}

static int32_t Process_EraseFlash(uint32_t u32Addr, uint32_t u32PageCount)
{
    uint32_t    i, u32PacketID = 0x31;

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_ERASE;
    g_WriteCmd.u16PacketID  = u32PacketID;
    g_WriteCmd.u16Len       = 8;
    g_WriteCmd.au32Data[0]  = u32Addr;
    g_WriteCmd.au32Data[1]  = u32PageCount;

    if(_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);
    if(usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while(g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if(_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if(g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

    if(g_ReturnData.au32Data[0] != 0)
        return g_ReturnData.au32Data[0];

    return 0;
}

static int32_t Process_WriteFlash(uint32_t u32Addr, uint32_t u32ByteCount, uint32_t *pu32Buf)
{
    uint32_t    i, u32PacketID = 0x32;

    if(u32ByteCount > 40)
        return -1; // valid data length can not large than 40 bytes

    memset(&g_WriteCmd, 0x0, sizeof(CMD_PACKET_T));
    memset(&g_ReturnData, 0xFF, sizeof(CMD_PACKET_T));

    g_WriteCmd.u16CmdID     = CMD_WRITE;
    g_WriteCmd.u16PacketID  = u32PacketID;
    g_WriteCmd.u16Len       = 4 + u32ByteCount;
    g_WriteCmd.au32Data[0]  = u32Addr;
    g_WriteCmd.au32Data[1]  = u32ByteCount;
    for(i = 0; i < (u32ByteCount / 4); i++)
        g_WriteCmd.au32Data[i + 2]  = pu32Buf[i];

    if(_Perform_GenPacket(&g_WriteCmd) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_GenPacket. (L:%d)\n", __LINE__);
        return -1;
    }

    g_ChipISPInfo.u32IsRXReady = 0;

    usbh_hid_stop_int_write((HID_DEV_T *)g_pHDEV, 0);
    if(usbh_hid_start_int_write((HID_DEV_T *)g_pHDEV, 0, int_write_callback) != HID_RET_OK)
    {
        DBG("\n[FAIL] ==> Interrupt out transfer started...\n");
        return -1;
    }

    while(g_ChipISPInfo.u32IsRXReady != 0x5A5A) {}

    if(_Perform_ParsePacket(&g_ReturnData) != 0)
    {
        DBG("\n[FAIL] ==> _Perform_ParsePacket. (L:%d)\n", __LINE__);
        return -1;
    }

    if(g_ReturnData.u16PacketID != u32PacketID)
        return ERR_CMD_PACKET_NUM;

