OpenNuvoton/M2354BSP/SampleCode/SecureApplication/USBH_SecureISP/ProcessCommand.c
        if(u32Item == 2)
        {
            i = j = 0;
            do
            {
                for(i = 0; i < (32 / 4); i++)
                    g_ChipISPInfo.au32Tmp[i] = 0x5a5a0000 + i + (j / 4);
                if(Process_WriteFlash(0x10000 + j, 32, g_ChipISPInfo.au32Tmp) != 0)
                {
                    printf("\nProcess_WriteFlash FAIL. (L:%d)\n", __LINE__);
                    while(1) {}
                }
                j += 32;
            }
            while((0x10000 + j) < 0x11000);
        }

        if(u32Item == 3)
        {
            g_ChipISPInfo.au32Tmp[0] = (4 * 1); // vendor cmd: byte counts
            g_ChipISPInfo.au32Tmp[1] = 0x1000;  // vendor cmd: command ID
            if(Process_VendorFunc(g_ChipISPInfo.au32Tmp) != 0)
            {
                printf("\nVendor cmd:0x%x FAIL. (L:%d)\n", 0x1000, __LINE__);
                while(1) {}
            }
        }

        if(u32Item == 4)
        {
            i = j = 0;
            do
            {
                g_ChipISPInfo.au32Tmp[0] = (4 * 3);     // vendor cmd: byte counts
                g_ChipISPInfo.au32Tmp[1] = 0x2000;      // vendor cmd: command ID
                g_ChipISPInfo.au32Tmp[2] = 0x10000 + j; // vendor cmd: addr
                g_ChipISPInfo.au32Tmp[3] = 32;          // vendor cmd: read byte size
                if(Process_VendorFunc(g_ChipISPInfo.au32Tmp) != 0)
                {
                    printf("\nVendor cmd:0x%x FAIL. (Addr:0x%x) (L:%d)\n", 0x2000, (0x10000 + j), __LINE__);
                    while(1) {}
                }
                j += 32;
            }
            while((0x10000 + j) < 0x11000);
        }

        if(u32Item == 5)
        {
            i = j = 0;
            do
            {
                g_ChipISPInfo.au32Tmp[0] = (4 * 11);    // vendor cmd: byte counts
                g_ChipISPInfo.au32Tmp[1] = 0x3000;      // vendor cmd: command ID
                g_ChipISPInfo.au32Tmp[2] = 0x10000 + j; // vendor cmd: addr
                g_ChipISPInfo.au32Tmp[3] = 32;          // vendor cmd: write byte size
                for(i = 0; i < (32 / 4); i++)
                    g_ChipISPInfo.au32Tmp[4 + i] = 0x0000a5a5 + ((i + (j / 4)) << 16);
                if(Process_VendorFunc(g_ChipISPInfo.au32Tmp) != 0)
                {
                    printf("\nVendor cmd:0x%x FAIL. (Addr:0x%x) (L:%d)\n", 0x3000, (0x10000 + j), __LINE__);
                    while(1) {}
                }
                j += 32;
            }
            while((0x10000 + j) < 0x11000);
        }

        if(u32Item == 90)
        {
            if(Process_ResetDevice() == 0)
            {
                delay_us(1000000);
                SYS->IPRST0 |= SYS_IPRST0_CHIPRST_Msk;
                break;
            }
        }
    }

    return 0;
}

/*** (C) COPYRIGHT 2020 Nuvoton Technology Corp. ***/
